; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v6)
		(pred_5 ?v1)
		(pred_1 ?v4)
		(pred_2 ?v4)
		(pred_3 ?v1 ?v4)
		(pred_4)
		(pred_6 ?v1))

   (:action op_1
       :parameters  (?v3 ?v8)
       :precondition (and (not-eq ?v3 ?v8) 
                          (pred_1 ?v3) (pred_1 ?v8) (pred_2 ?v3))
       :effect (and  (pred_2 ?v8)
		     (not (pred_2 ?v3))))


   (:action op_2
       :parameters (?v2 ?v7)
       :precondition  (and  (pred_5 ?v2) (pred_1 ?v7)
			    (pred_3 ?v2 ?v7) (pred_2 ?v7) (pred_4))
       :effect (and (pred_6 ?v2)
		    (not (pred_3 ?v2 ?v7)) 
		    (not (pred_4))))

   (:action op_3
       :parameters  (?v2  ?v7)
       :precondition  (and  (pred_5 ?v2) (pred_1 ?v7)
			    (pred_6 ?v2) (pred_2 ?v7))
       :effect (and (pred_3 ?v2 ?v7)
		    (pred_4)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_05 obj_01 obj_06 obj_03 
          obj_04 obj_02 
)
(:init
(pred_1 obj_05)
(pred_1 obj_01)
(pred_1 obj_06)
(pred_1 obj_03)
(pred_5 obj_04)
(pred_5 obj_02)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(pred_4)
(pred_3 obj_04 obj_01)
(pred_3 obj_02 obj_06)
(pred_2 obj_01)
)
(:goal
(and
(pred_3 obj_04 obj_03)
(pred_3 obj_02 obj_06)
)
)

(:constraints
  (sometime-before  (pred_3 obj_04 obj_03) (pred_2 obj_05))
)
)

; plan
1. (op_2 obj_04 obj_01)
   deleted: (pred_3 obj_04 obj_01) (pred_4)
   added: (pred_6 obj_04)
   goals met: 1 of 2
2. (op_1 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 1 of 2
3. (op_3 obj_04 obj_06)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_06) (pred_4)
   goals met: 1 of 2
4. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02 obj_06) (pred_4)
   added: (pred_6 obj_02)
   goals met: 0 of 2
5. (op_1 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 0 of 2
6. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_05) (pred_4)
   goals met: 0 of 2
7. (op_1 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 2
8. (op_2 obj_04 obj_06)
   deleted: (pred_3 obj_04 obj_06) (pred_4)
   added: (pred_6 obj_04)
   goals met: 0 of 2
9. (op_1 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_03)
   goals met: 0 of 2
10. (op_3 obj_04 obj_03)
   deleted: (pred_6 obj_04)
   added: (pred_3 obj_04 obj_03) (pred_4)
   goals met: 1 of 2
11. (op_1 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 1 of 2
12. (op_2 obj_02 obj_05)
   deleted: (pred_3 obj_02 obj_05) (pred_4)
   added: (pred_6 obj_02)
   goals met: 1 of 2
13. (op_1 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 1 of 2
14. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_06) (pred_4)
   goals met: 2 of 2
